# SillHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..SillHeight Property
MassSurfaceData Class See Also
---
The height above the level where the bottoms of auto-generated windows will be located.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double SillHeight { get; set; }
```

Visual Basic
---
```text
Public Property SillHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SillHeight {
	double get ();
	void set (double value);
}
```

# Remarks
Will be accurate unless the target glazing percentage cannot be achieved using this height. In that case, the sillHeight will be ignored and windows will be created below this height.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The sill height is less than zero. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace